### DataFrame Eleman Islemleri

In [28]:
import numpy as np
import pandas as pd
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [29]:
sozluk = {"var1":s1, "var2":s2, "var3":s3}

In [30]:
sozluk

{'var1': array([3, 2, 4, 6, 9]),
 'var2': array([9, 1, 8, 7, 0]),
 'var3': array([2, 4, 6, 0, 9])}

In [31]:
df = pd.DataFrame(sozluk)

In [32]:
df

   var1  var2  var3
0     3     9     2
1     2     1     4
2     4     8     6
3     6     7     0
4     9     0     9

In [33]:
df[0:1]

   var1  var2  var3
0     3     9     2

In [34]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [35]:
df.index = ["a","b","c","d","e"]

In [36]:
df

   var1  var2  var3
a     3     9     2
b     2     1     4
c     4     8     6
d     6     7     0
e     9     0     9

In [37]:
df["c":"e"]

   var1  var2  var3
c     4     8     6
d     6     7     0
e     9     0     9

* Silme İşlemi

In [38]:
df.drop("a", axis = 0)  #satırı almak istediğimizi belirttik.

   var1  var2  var3
b     2     1     4
c     4     8     6
d     6     7     0
e     9     0     9

 * inplace degisikligi kalici sekilde kaydeder.

In [39]:
df.drop("c", axis = 0, inplace = True)

In [40]:
df

   var1  var2  var3
a     3     9     2
b     2     1     4
d     6     7     0
e     9     0     9

* Fancy

In [43]:
l = {"b","d"}

In [44]:
df.drop(l, axis = 0)

   var1  var2  var3
a     3     9     2
e     9     0     9

* Degiskenler icin

In [45]:
"var1" in df

True

In [46]:
l = ["var1","var4","var2"]

In [47]:
for i in l:
    print(i in df)

True
False
True

In [48]:
df

   var1  var2  var3
a     3     9     2
b     2     1     4
d     6     7     0
e     9     0     9

* Elemana erismek:

In [49]:
df["var1"]

a    3
b    2
d    6
e    9
Name: var1, dtype: int32

* Olmayan bir elemana erismek istedigimizde bunu eleman ekleme olarak kabul eder.

In [50]:
df["var4"] = df["var1"] / df["var2"]

In [51]:
df

   var1  var2  var3      var4
a     3     9     2  0.333333
b     2     1     4  2.000000
d     6     7     0  0.857143
e     9     0     9       inf

* Degisken silmek:

In [52]:
df.drop("var4", axis = 1)

   var1  var2  var3
a     3     9     2
b     2     1     4
d     6     7     0
e     9     0     9

In [53]:
df

   var1  var2  var3      var4
a     3     9     2  0.333333
b     2     1     4  2.000000
d     6     7     0  0.857143
e     9     0     9       inf

In [54]:
df.drop("var4", axis = 1, inplace = True)

In [55]:
df

   var1  var2  var3
a     3     9     2
b     2     1     4
d     6     7     0
e     9     0     9

In [56]:
l = ["var1","var2"]

In [57]:
df.drop(l, axis = 1)

   var3
a     2
b     4
d     0
e     9